from module import *

def TestSdelatMnozhestvoPustym():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    SdelatMnozhestvoPustym(M) # Вызываем проверяемую функцию (сделать множество пустым)

    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[0] == 0 # Проверяем, действительно ли служебный элемент говорит о том, что множество пусто

    print("Множество успешно обозначено пустым")

TestSdelatMnozhestvoPustym()