from module import *

def TestSdelatMnozhestvoPustym():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    SdelatMnozhestvoPustym(M) # Вызываем проверяемую функцию (сделать множество пустым)

    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[0] == 0 # Проверяем, действительно ли служебный элемент говорит о том, что множество пусто

    print("Множество успешно обозначено пустым")

TestSdelatMnozhestvoPustym()

def TestMnozhestvoPusto():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)
    M[0] = 0

    assert MnozhestvoPusto(M) # Вызываем проверяемую функцию (множество пусто) и тут же проверяем ответ
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней

    for i in range(1, N+1):
        assert M[i] == PROBEL # Проверка, остались ли элементы множества неизменны

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    assert not MnozhestvoPusto(M) # Вызываем проверяемую функцию (множество пусто) и тут же проверяем ответ
    assert M[1] == 4 and M[2] == 2 and M[3] == 9 # Проверка, остались ли элементы множества неизменны

    print("Множество успешно проверено на пустоту")

TestMnozhestvoPusto()

def TestMnozhestvoNePusto():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)
    M[0] = 0

    assert not MnozhestvoNePusto(M) # Вызываем проверяемую функцию (множество не пусто) и тут же проверяем ответ
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней

    for i in range(1, N+1):
        assert M[i] == PROBEL # Проверка, остались ли элементы множества неизменны

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    assert MnozhestvoNePusto(M) # Вызываем проверяемую функцию (множество не пусто) и тут же проверяем ответ
    assert M[1] == 4 and M[2] == 2 and M[3] == 9 # Проверка, остались ли элементы множества неизменны

    print("Множество успешно проверено на наличие элементов")

TestMnozhestvoNePusto()

def TestEstSvobodnoeMesto():
    N = 10
    K = N
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)
    M[0] = 1
    M[1] = 54

    assert EstSvobodnoeMesto(M, N) # Вызываем проверяемую функцию (есть свободное место) и тут же проверяем ответ
    assert N == K # Проверяем, осталось ли значение N прежним
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[1] == 54 # Проверка, остались ли элементы множества неизменны

    M[0] = N
    M[1] = 12

    assert not EstSvobodnoeMesto(M, N) # Вызываем проверяемую функцию (есть свободное место) и тут же проверяем ответ
    assert M[1] == 12 # Проверка, остались ли элементы множества неизменны

    print("Функция на наличие свободного места успешно отработала")

TestEstSvobodnoeMesto()

def TestNetSvobodnogoMesta():
    N = 10
    K = N
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)
    M[0] = 1
    M[1] = 54

    assert not NetSvobodnogoMesta(M, N) # Вызываем проверяемую функцию (нет свободного места) и тут же проверяем ответ
    assert N == K # Проверяем, осталось ли значение N прежним
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[1] == 54 # Проверка, остались ли элементы множества неизменны

    M[0] = N
    M[1] = 12

    assert NetSvobodnogoMesta(M, N) # Вызываем проверяемую функцию (нет свободного места) и тут же проверяем ответ
    assert M[1] == 12 # Проверка, остались ли элементы множества неизменны

    print("Функция на отсутствие свободного места успешно отработала")

TestNetSvobodnogoMesta()

def TestElementPrinadlezhitMnozhestvu():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    assert ElementPrinadlezhitMnozhestvu(M, M[2]) # Вызываем проверяемую функцию (элемент принадлежит множеству) и тут же проверяем ответ
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[1] == 4 and M[2] == 2 and M[3] == 9 # Проверка, остались ли элементы множества неизменны

    assert not ElementPrinadlezhitMnozhestvu(M, 500) # Вызываем проверяемую функцию (элемент принадлежит множеству) и тут же проверяем ответ

    print("Функция проверки принадлежности элемента ко множеству успешно отработала")

TestElementPrinadlezhitMnozhestvu()

def TestElementNePrinadlezhitMnozhestvu():
    N = 10
    M = [PROBEL] * (N+1) # Создаем множество длиной N+1 (+1 для возможности индексации от 1 до N)

    M[0] = 3 # Заполняем множество элементами 
    M[1] = 4
    M[2] = 2
    M[3] = 9

    assert not ElementNePrinadlezhitMnozhestvu(M, M[2]) # Вызываем проверяемую функцию (элемент не принадлежит множеству) и тут же проверяем ответ
    assert len(M) == N+1 # Проверяем, осталась ли длина прежней
    assert M[1] == 4 and M[2] == 2 and M[3] == 9 # Проверка, остались ли элементы множества неизменны

    assert ElementNePrinadlezhitMnozhestvu(M, 500) # Вызываем проверяемую функцию (элемент не принадлежит множеству) и тут же проверяем ответ

    print("Функция проверки отсутствия принадлежности элемента ко множеству успешно отработала")

TestElementNePrinadlezhitMnozhestvu()