from module import *

def TestNachatRabotu():
    NachatRabotu() # Вызываем проверяемую функцию

TestNachatRabotu()

def TestSdelatStackPustym():
    N = 10
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 1 # Ставим служебный элемент в значение 1 и заполняем стек
    S[1] = 3

    print(f"Изначальная длина стека: {len(S)}")

    SdelatStackPustym(S)

    print(f"Новая длина стека: {len(S)}")
    print(f"Значение служебного элемента: {S[0]}")

TestSdelatStackPustym()

def TestStackPust():
    N = 10
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Ответ функции 'СтекПуст' при пустом стеке: {StackPust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

    S[0] = 1
    S[1] = 3

    print(f"Ответ функции 'СтекПуст' при не пустом стеке: {StackPust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestStackPust()

def TestStackNePust():
    N = 10
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Ответ функции 'СтекНеПуст' при пустом стеке: {StackNePust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

    S[0] = 1
    S[1] = 3

    print(f"Ответ функции 'СтекНеПуст' при не пустом стеке: {StackNePust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestStackNePust()

def TestDobavitVStack():
    N = 3
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")

    element = 7
    DobavitVStack(S, N, element)

    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")
    print(f"Пытались добавить элемент {element}, а добавился: {S[1]}")

    DobavitVStack(S, N, element)
    DobavitVStack(S, N, element)

    try :
        DobavitVStack(S, N, element)
        print("Переполнения не случилось")
    except:
        print("Успешное переполнение стека")

TestDobavitVStack()

def TestEstSvobodnoeMesto():
    N = 1
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Ответ функции 'ЕстьСвободноеМесто' при наличии свободного места в стеке: {EstSvobodnoeMesto(S, N)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

    S[0] = 1
    S[1] = 3

    print(f"Ответ функции 'ЕстьСвободноеМесто' при полном стеке: {EstSvobodnoeMesto(S, N)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestEstSvobodnoeMesto()

def TestNetSvobodnogoMesta():
    N = 1
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Ответ функции 'НетСвободногоМеста' при наличии свободного места в стеке: {NetSvobodnogoMesta(S, N)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

    S[0] = 1
    S[1] = 3

    print(f"Ответ функции 'НетСвободногоМеста' при полном стеке: {NetSvobodnogoMesta(S, N)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestNetSvobodnogoMesta()

def TestDostatIzStacka():
    N = 1
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 1
    S[1] = 3

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Полученный элемент из стека: {DostatIzStacka(S)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")
    print(f"Полученный элемент при пустом стеке: {DostatIzStacka(S)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestDostatIzStacka()

def TestVershinaStacka():
    N = 1
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 1
    S[1] = 3

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Полученная вершина стека: {VershinaStacka(S)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

TestVershinaStacka()

def TestUdalitIzStacka():
    N = 1
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 1
    S[1] = 3

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    UdalitIzStacka(S)
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

TestUdalitIzStacka()