from module import *

def TestNachatRabotu():
    NachatRabotu() # Вызываем проверяемую функцию

TestNachatRabotu()

def TestSdelatStackPustym():
    N = 10
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 1 # Ставим служебный элемент в значение 1 и заполняем стек
    S[1] = 3

    print(f"Изначальная длина стека: {len(S)}")

    SdelatStackPustym(S)

    print(f"Новая длина стека: {len(S)}")
    print(f"Значение служебного элемента: {S[0]}")

TestSdelatStackPustym()

def TestStackPust():
    N = 10
    S = [" "] * (N+1) # Создаем ряд длиной N+1 для возможности индексации от 1 до N
    S[0] = 0

    print(f"Изначальная длина стека: {len(S)}")
    print(f"Изначальное значение служебного элемента: {S[0]}")
    print(f"Ответ функции 'СтекПуст' при пустом стеке: {StackPust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ
    print(f"Новая длина стека: {len(S)}")
    print(f"Новое значение служебного элемента: {S[0]}")

    S[0] = 1
    S[1] = 3

    print(f"Ответ функции 'СтекПуст' при не пустом стеке: {StackPust(S)}") # Вызываем проверяемую функцию и тут же выводим ответ

TestStackPust()